سه نفر برای خرید ساعتی به یک ساعت فروشی مراجعه میکنند.قیمت ساعت ۳۰ هزار تومان بوده و هر کدام نفری ۱۰ هزار تومن پرداخت میکنند. تا آن ساعت را خریداری کنند...
بعد از رفتن آنها ، صاحب مغازه به شاگردش میگوید قیمت ساعت ۲۵ هزار تومان بوده.
این ۵ هزار تومان را بگیر و به آنها برگردان
شاگرد ۲ هزار تومان را برای خود بر میدارد
و ۳ هزار تومان باقیمانده را به آنها برمیگرداند. (نفری هزار تومان)
حال هر کدام از آنها نفری ۹ هزار تومان پرداخت کرده اند . که ۳*۹ برابر ۲۷ میشود
این مبلغ به علاوه آن ۲ هزار تومان که پیش شاگرد است میشود ۲۹ تومان
هزار تومان باقیمانده کجاست ؟